Rumble/app/controllers/traficgowexes_controller.rb

  def index
    @traficgowexes = Traficgowex.all
---
SELECT "traficgowexes".* FROM "traficgowexes"

    def set_traficgowex
      @traficgowex = Traficgowex.find(params[:id])
---
SELECT  "traficgowexes".* FROM "traficgowexes"  WHERE "traficgowexes"."id" = ? LIMIT 1  [["id", 1]]