Rumble/app/controllers/wifiusers_controller.rb

  def index
    @wifiusers = Wifiuser.all
---
SELECT "wifiusers".* FROM "wifiusers"

  def update
    respond_to do |format|
      if @wifiuser.update(wifiuser_params)
---
UPDATE "wifiusers" SET "nationality" = ?, "updated_at" = ? WHERE "wifiusers"."id" = 2  [["nationality", "Espagne"], ["updated_at", "2014-07-29 07:56:58.984943"]]

  def destroy
    @wifiuser.destroy
---
DELETE FROM "wifiusers" WHERE "wifiusers"."id" = ?  [["id", 2015]]

    def set_wifiuser
      @wifiuser = Wifiuser.find(params[:id])
---
SELECT  "wifiusers".* FROM "wifiusers"  WHERE "wifiusers"."id" = ? LIMIT 1  [["id", 2059]]