Rumble/app/controllers/wificonsos_controller.rb

  def index
    @wificonsos = Wificonso.all
---
SELECT "wificonsos".* FROM "wificonsos"

    def set_wificonso
      @wificonso = Wificonso.find(params[:id])
---
SELECT  "wificonsos".* FROM "wificonsos"  WHERE "wificonsos"."id" = ? LIMIT 1  [["id", 27]]